{
  "segmentId": 3,
  "audioResponse": {
    "audioUrl": "/audio/segment_3.mp3"
  },
  "sceneResponse": {
    "shots": [
      {
        "shotNumber": 1,
        "characters": [
          "Nick Carraway"
        ],
        "description": "Medium close-up on Nick's contemplative face, low-key lighting casting shadows that accentuate his furrowed brow. The camera lingers, capturing the weight of his inner turmoil.",
        "dialogue": "\"...the fundamental decencies is parcelled out unequally at birth.\"",
        "tone": "Introspective, philosophical"
      },
      {
        "shotNumber": 2,
        "characters": [
          "Nick Carraway"
        ],
        "description": "Close-up on Nick's eyes, a flicker of doubt and uncertainty reflected in them. The camera slowly pulls back, revealing him alone in a dimly lit room, surrounded by shadows.",
        "dialogue": "\"And, after boasting this way of my tolerance, I come to the admission that it has a limit.\"",
        "tone": "Self-aware, conflicted"
      },
      {
        "shotNumber": 3,
        "characters": [
          "Nick Carraway"
        ],
        "description": "Over-the-shoulder shot, framing Nick's silhouette against a window overlooking the vibrant city lights. The contrast between his stillness and the bustling world outside is stark.",
        "dialogue": "\"Conduct may be founded on the hard rock or the wet marshes, but after a certain point I don't care what it's founded on.\"",
        "tone": "Disillusioned, weary"
      },
      {
        "shotNumber": 4,
        "characters": [
          "Nick Carraway"
        ],
        "description": "Close-up on Nick's face, a subtle shift in his expression as he recalls a memory. The camera slowly pans to reveal a glimpse of the autumn landscape through the window, leaves falling gently.",
        "dialogue": "\"When I came back from the East last autumn I felt that I wanted the world to be in uniform and at a sort of moral attention forever...\"",
        "tone": "Nostalgic, yearning"
      },
      {
        "shotNumber": 5,
        "characters": [
          "Nick Carraway"
        ],
        "description": "Medium shot, framing Nick in the center of the frame, his body language conveying a sense of weariness and disillusionment. The lighting is low and moody, casting long shadows across the room.",
        "dialogue": "\"...I wanted no more riotous excursions with privileged glimpses into the human heart.\"",
        "tone": "Disillusioned, world-weary"
      },
      {
        "shotNumber": 6,
        "characters": [
          "Nick Carraway"
        ],
        "description": "Close-up on Nick's face, his expression softening as he remembers Gatsby. The camera slowly pulls back, revealing a framed photograph of Gatsby on a nearby table, bathed in a warm, nostalgic glow.",
        "dialogue": "\"Only Gatsby, the man who gives his...\"",
        "tone": "Nostalgic, fondness"
      }
    ],
    "newCharacters": []
  }
}