{
  "segmentId": 2,
  "audioResponse": {
    "audioUrl": "/audio/segment_2.mp3"
  },
  "sceneResponse": {
    "shots": [
      {
        "shotNumber": 1,
        "characters": [
          "Nick Carraway"
        ],
        "description": "Close-up on Nick's pensive face, his eyes slightly narrowed, the dim lighting casting shadows that accentuate his furrowed brow. The camera lingers, capturing his introspective gaze.",
        "dialogue": "Most of the confidences were unsought—frequently I have feigned sleep, preoccupation, or a hostile levity when I realized by some unmistakable sign that an intimate revelation was quivering on the horizon...",
        "tone": "Reflective, guarded"
      },
      {
        "shotNumber": 2,
        "characters": [],
        "description": "A low-angle shot of a dimly lit room, the shadows obscuring most of the details, creating a sense of mystery and secrecy. The camera slowly pans across the room, revealing glimpses of opulent furnishings and decor, hinting at the wealth and status of the inhabitants.",
        "dialogue": "...for the intimate revelations of young men, or at least the terms in which they express them, are usually plagiaristic and marred by obvious suppressions.",
        "tone": "Enigmatic, atmospheric"
      },
      {
        "shotNumber": 3,
        "characters": [
          "Nick Carraway"
        ],
        "description": "A close-up shot of Nick's face, his expression a mix of curiosity and caution. The lighting casts a warm glow, highlighting his thoughtful demeanor.",
        "dialogue": "Reserving judgements is a matter of infinite hope.",
        "tone": "Contemplative, introspective"
      },
      {
        "shotNumber": 4,
        "characters": [
          "Nick Carraway"
        ],
        "description": "A medium shot of Nick, slightly off-center in the frame, with the background blurred, creating a sense of isolation. His posture is relaxed, but his eyes betray a hint of apprehension.",
        "dialogue": "I am still a little afraid of missing something if I forget that, as my father snobbishly suggested, and I snobbishly repeat, a sense...",
        "tone": "Pensive, self-aware"
      }
    ],
    "newCharacters": []
  }
}