{
  "segmentId": 1,
  "audioResponse": {
    "audioUrl": "/audio/pride and prejudice_segment_1.mp3"
  },
  "sceneResponse": {
    "shots": [
      {
        "shotNumber": 1,
        "characters": [
          "Narrator"
        ],
        "description": "A close-up shot of an open book, the pages slightly yellowed with age. The camera slowly pans across the text, revealing the words 'personal love' in an elegant script.",
        "dialogue": null,
        "tone": "Contemplative, scholarly"
      },
      {
        "shotNumber": 2,
        "characters": [
          "Narrator"
        ],
        "description": "A wide shot of a cozy library, shelves filled with leather-bound volumes. A warm, flickering fireplace casts dancing shadows on the walls.",
        "dialogue": "This distinction applies to books as well as to men and women; and in the case of the not very numerous authors who are the objects of the personal affection, it brings a curious consequence with it.",
        "tone": "Reflective, analytical"
      },
      {
        "shotNumber": 3,
        "characters": [
          "Narrator"
        ],
        "description": "A close-up shot of a quill pen resting on an ink-stained desk, the camera slowly panning to reveal a stack of handwritten pages.",
        "dialogue": "There is much more difference as to their best work than in the case of those others who are loved 'by allowance' by convention, and because it is felt to be the right and proper thing to love them.",
        "tone": "Insightful, literary"
      },
      {
        "shotNumber": 4,
        "characters": [
          "Narrator"
        ],
        "description": "A medium shot of a group of people gathered in a dimly lit room, their faces obscured but their postures suggesting deep discussion and debate.",
        "dialogue": "And in the sect--fairly large and yet unusually choice--of Austenians or Janites, there would probably be found partisans of the claim to...",
        "tone": "Intriguing, enigmatic"
      }
    ],
    "newCharacters": []
  }
}